Autodesk.Navisworks.Api.Matrix3
A 3x3 matrix.

Autodesk.Navisworks.Api.Matrix3.#ctor
Default constructor. Makes an identity matrix.

Autodesk.Navisworks.Api.Matrix3.#ctor(Autodesk.Navisworks.Api.Rotation3D)
Make from a rotation.
Throws System.ArgumentNullException:
Argument 'rotation' is null
Throws System.ArgumentException:
Argument 'rotation' has been Disposed

Autodesk.Navisworks.Api.Matrix3.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Make from elements specified in row major order.

Autodesk.Navisworks.Api.Matrix3.Determinant
Get determinant of matrix.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Matrix3.Equals(Autodesk.Navisworks.Api.Matrix3)
Equal within a tolerance, each element of matrix is equal to corresponding element within given tolerance.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'matrix' is null
Throws System.ArgumentException:
Argument 'matrix' has been Disposed

Autodesk.Navisworks.Api.Matrix3.Equals(Autodesk.Navisworks.Api.Matrix3,System.Double)
Equal within a tolerance, each element of matrix is equal to corresponding element within given tolerance.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'matrix' is null
Throws System.ArgumentException:
Argument 'matrix' has been Disposed

Autodesk.Navisworks.Api.Matrix3.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Matrix3.Get(System.Int32,System.Int32)
"Get a single matrix element."
Throws System.ArgumentOutOfRangeException:
Argument 'row' out of range
Throws System.ArgumentOutOfRangeException:
Argument 'column' out of range

Autodesk.Navisworks.Api.Matrix3.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Matrix3.IsIdentity
Is matrix the identity matrix ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Matrix3.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Matrix3.IsZero
Is matrix a zero matrix? A zero matrix is one where every component is 0.0.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Matrix3.ToString
Returns a  that represents the current .
Returns: A  that represents the current .